[
    {"book": 1, "review_text": "An emotionally touching story, John Green captures the essence of love and loss."},
    {"book": 2, "review_text": "Magical and enchanting, J.K. Rowling's world-building is unparalleled."},
    {"book": 3, "review_text": "Stephen King's 'IT' is a gripping horror masterpiece that will haunt your dreams."},
    {"book": 4, "review_text": "Haruki Murakami's 'Norwegian Wood' is a beautifully melancholic journey."},
    {"book": 5, "review_text": "Chimamanda Ngozi Adichie's 'Half of a Yellow Sun' is a powerful portrayal of war."},
    {"book": 6, "review_text": "Jane Austen's 'Pride and Prejudice' remains a timeless classic."},
    {"book": 7, "review_text": "Gabriel García Márquez weaves a mesmerizing tapestry of magical realism in 'One Hundred Years of Solitude'."},
    {"book": 8, "review_text": "Margaret Atwood's 'The Handmaid's Tale' is a thought-provoking dystopian masterpiece."},
    {"book": 9, "review_text": "George Orwell's '1984' is a chilling warning about the dangers of totalitarianism."},
    {"book": 10, "review_text": "Agatha Christie's 'Murder on the Orient Express' is a brilliant whodunit."},
    {"book": 11, "review_text": "Ernest Hemingway's 'The Old Man and the Sea' is a testament to the indomitable human spirit."},
    {"book": 12, "review_text": "Maya Angelou's 'I Know Why the Caged Bird Sings' is a poignant memoir of resilience."},
    {"book": 13, "review_text": "Toni Morrison's 'Beloved' is a haunting exploration of the legacy of slavery."},
    {"book": 14, "review_text": "J.R.R. Tolkien's 'The Hobbit' is a delightful adventure in Middle-earth."},
    {"book": 15, "review_text": "Leo Tolstoy's 'War and Peace' is an epic masterpiece of Russian literature."},
    {"book": 16, "review_text": "Alice Walker's 'The Color Purple' is a powerful narrative of strength and sisterhood."},
    {"book": 17, "review_text": "Kazuo Ishiguro's 'Never Let Me Go' is a poignant and heartbreaking dystopian tale."},
    {"book": 18, "review_text": "Herman Melville's 'Moby-Dick' is a literary classic that delves into the depths of obsession."},
    {"book": 19, "review_text": "Virginia Woolf's 'Mrs. Dalloway' is a stream-of-consciousness masterpiece."},
    {"book": 20, "review_text": "Mark Twain's 'The Adventures of Tom Sawyer' is a delightful journey into the world of a mischievous boy."},
    {"book": 21, "review_text": "J.D. Salinger's 'The Catcher in the Rye' captures the angst of adolescence with authenticity."},
    {"book": 22, "review_text": "Harper Lee's 'To Kill a Mockingbird' is a timeless exploration of racial injustice."},
    {"book": 23, "review_text": "Aldous Huxley's 'Brave New World' is a dystopian vision of a controlled society."},
    {"book": 24, "review_text": "F. Scott Fitzgerald's 'The Great Gatsby' is a compelling critique of the American Dream."},
    {"book": 25, "review_text": "Emily Brontë's 'Wuthering Heights' is a dark and passionate tale of love and revenge."}
]
